@extends('layouts.public.extendable')

@section('content')
<ol class="breadcrumb">
    <li><i class="fa fa-terminal"></i></li>
    <li>{{ HTML::link('/', 'Начало') }}</li>
    <li>За нас</li>
</ol>

<h3><a href="#">За нас</a></h3>
<p>
    През 2007-ма година Иван Ванков (познат с псевдонима си Гатака) започва да публикува видео-уроци за програмиране на PHP в личният си дневник, който тогава се намира на blog.gatakka.eu. Това е ново за България. До този момент, никой у нас не беше правил такова нещо. Обяснява решението си горе-долу така — смятам, че знанието трябва да се разпрострaнява свободно, а не всеки да си го къта. Не изпитвам никакъв страх, че като науча някого на това, което знам, че той ще ми изяде хляба. Кадърният човек няма да остане без работа. Напротив, по този начин подпомагам за повишаването на общите умения и това един ден може да се върне при мен. Реших да ги правя на видео, защото от професионалния си опит съм открил, че хората запомнят най-добре, като нещо им се покаже.
</p>
<p>
    Успехът не закъснява и е феноменален. Иван се оказва роден с талант за преподаване. Обяснява съвсем достъпно и най-сложните концепции и абстракции в програмирането. Трупат се въпроси, идват много хора. Езиковата летва е свалена и много млади хора могат да се докоснат до технологиите. Тогава решава да открие и форум, тогава на адрес forum.gatakka.eu. Още повече хора са привлечени. Потребители започват да изпращат на Иван свои уроци. Видео-съдържание започва да се появява и на традиционни места като "Турист в ИТ". Карнофейдж пък прави портал специално за видео-уроци.
</p>
<p>
    Уроците се трупат, започвайки от самите основи, се стига все по-надълбоко. Иван вижда, че идеята става голяма и решава, че трябва да раздели това съдържание от личните си преживявания, които описва в дневника си. Така се ражда "Научи ме". Всички уроци са преместени там и се прави изцяло нов форум, който да обедини желаещите за взаимопомощ. След около година се вижда, че новият портал отнема прекалено много време и Иван не може вече да се справя с всичко сам. Тогава решава, че трябва да подари "Научи ме" на неговите потребители. Инициатива проявява Стоян Германов (познат като Ечеверия) и се опитва да убеди Windows user, че идеята е добра. Wuser, който също е видял съобщението смята идеята за абсурдна и, че няма да се справят. Германов е убедителен човек и постига своето.
</p>
<p>
    Двамата приятели провеждат преговори с Иван Ванков и получават контрола върху съдържанието. Във форума набързо са събрани пари за домуване и всичко се прехвърля. Междувременно Германов успява да уговори още няколко от старите потребители на forum.gatakka.eu да се включат и да помогнат с техническите предизвикателства. В момента "Научи ме" е проект движен изцяло от своите потребители. Иван Ванков не е забравил старият си проект и помага с малки дарения, а също така прави нови серии от уроци.
</p>
<p>
    Идеята на "Научи ме" се оказва толкова успешна, че е подета от десетки подражатели. Най-успешният от тях "Учи се" има над хиляда урока — по думите на създателите си — за всички дисциплини от началното и средношколското образование.
</p>
<p>
    Иван Ванков гледа и в бъдещето. Иска да създаде универсална система за обучение, но проекта се забавя. Междувременно "Научи ме" запълва празнината. Тематиката е предимно техническа, но се приемат уроци от всички сфери на живота. Форумът пък е винаги отворен за потребителите си. Той също претърпява развитие, като става по-социален. Пренесен е на SMF. Появява се система за благодарности и вграден чат. Решенията за бъдещето се вземат от самите потребители след гласуване. Следващото дело е да се създаде собствена система за портала. Предизвикателството е прието от Аваланч, който го и реализира.
</p>
<p>
    А за напред? Ще създадем бъдещето всички заедно!
</p>

@stop